read_verilog hardware/boards/artix7/spu_a7_blinky_top.v
synth_xilinx -family xc7 -top spu_a7_blinky_top -json build/spu_a7_100t_BLINKY.json
stat -top spu_a7_blinky_top
